app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    @movies = Movie.order(params[:sort_param])